БухЭксп/Enums/ПлатежныеСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПлатежныеСервисы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОзонПэй</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексПэй</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/ПлатежныеСистемыСобытия/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем".
// ОбщийМодуль.ПлатежныеСистемыСобытия.
//
// Серверные процедуры обработки событий подсистемы Платежные системы:
//  - обработка событий настройки подключения;
//  - обработка событий прикладных операций;
//  - обработка событий запросов к сервису.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Формирует описание подчиненных подсистем для подсистемы ПлатежныеСистемы.
//   Вызывается из метода НастройкиПлатежныхСистемПовтИсп.ОписаниеПлатежныхСервисов
//
// Параметры:
//  ОписаниеПодсистем - Соответствие Из КлючИЗначение - описание подсистем:
//    * Ключ - Строка - платежная система
//    * Значение - см. НастройкиПлатежныхСистемСлужебный.НовыйОписаниеПлатежнойСистемы.
//
Процедура ПриОписанииПлатежныхСервисов(ОписаниеПодсистем) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриДобавленииОписанияПлатежныхСервисов(ОписаниеПодсистем);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		МодульЯндексПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСобытия");
		МодульЯндексПэйСобытия.ПриДобавленииОписанияПлатежныхСервисов(ОписаниеПодсистем);
	КонецЕсли;
	
КонецПроцедуры

// Преобразует способ оплаты, полученный из сервиса значения соответствующие методам
//   общего модуля ПлатежныеСистемыКлиентСервер.
// 
// Параметры:
//  ИдентификаторСистемы - Строка - идентификатор платежной системы. Доступные значения - "ОзонПэй", "ЯндексПэй".
//  СпособОплатыСервис - Строка - способ оплаты, полученный из сервиса.
//  СпособОплаты - Строка - результат преобразования способа оплаты.
//  
Процедура ПриОпределенииСпособаОплаты(ИдентификаторСистемы, СпособОплатыСервис, СпособОплаты) Экспорт
	
	Если Не ЗначениеЗаполнено(СпособОплатыСервис) Тогда
		Возврат;
	КонецЕсли;
	
 	Если ИдентификаторСистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй()
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриОпределенииСпособаОплаты(СпособОплатыСервис, СпособОплаты);
	
	// Для Яндекс Пэй способ оплаты не передается
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиПодключения

// Определяет данные подсказки по платежной системе.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, данные подсказки которой необходимо
//    получить.
//  РезультатОперации - см. ПлатежныеСистемыСлужебный.ПодсказкиПлатежнойСистемы.
//  ОписанияПлатежныхСистем - см. ПлатежныеСистемыСервис.ОписанияПлатежныхСистем.
//
Процедура ПриОпределенииПодсказокПлатежнойСистемы(
		ПлатежнаяСистема,
		РезультатОперации,
		ОписанияПлатежныхСистем) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатПодсказки  = МодульОзонПэйСлужебный.ПодсказкиПлатежнойСистемы(ОписанияПлатежныхСистем);
	
	ИначеЕсли ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		РезультатПодсказки  = МодульЯндексПэйСлужебный.ПодсказкиПлатежнойСистемы(ОписанияПлатежныхСистем);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить подсказки платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатПодсказки);
	
КонецПроцедуры

// Формирует строку с идентификатором платежной системы для подстановки в адресную строку запроса к сервису.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, идентификатор которой необходимо
//    получить.
//  РезультатОперации - Строка - строка подстановки.
//
Процедура ПриОпределенииБазовогоАдресаПлатежнойСистемы(ПлатежнаяСистема, РезультатОперации) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		
		РезультатОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1/%2",
			МодульОзонПэйСервис.КореньАдресаИнтеграции(),
			МодульОзонПэйСервис.ИдентификаторПлатежнойСистемы());
		
	ИначеЕсли ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСервис = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСервис");
		
		РезультатОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1/%2",
			МодульЯндексПэйСервис.КореньАдресаИнтеграции(),
			МодульЯндексПэйСервис.ИдентификаторПлатежнойСистемы());

	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить идентификатор платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
КонецПроцедуры

// Определяет данные реквизитов настройки аутентификации в сервисе платежной системы.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, реквизиты которой необходимо получить.
//  РезультатОперации - Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
//
Процедура ПриОпределенииРеквизитовНастройкиАутентификации(ПлатежнаяСистема, РезультатОперации) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатОперации = МодульОзонПэйСлужебный.РеквизитыНастройкиАутентификации();
		
	ИначеЕсли ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй Тогда
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		РезультатОперации = МодульЯндексПэйСлужебный.РеквизитыНастройкиАутентификации();

	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить реквизиты настройки аутентификации платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при проверке параметров авторизации.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - проверяемая платежная система.
//  ДанныеАутентификации - Структура - данные аутентификации в сервисах платежной системы.
//  РезультатПроверки - см. ПлатежныеСистемыСлужебный.НовыйРезультатОперации
//
Процедура ПриПроверкеПараметровАутентификации(ПлатежнаяСистема, ДанныеАутентификации, РезультатПроверки) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		РезультатОперации = МодульОзонПэйСервис.ПроверитьПараметрыПодключения(ДанныеАутентификации);
	
	ИначеЕсли ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСервис = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСервис");
		РезультатОперации = МодульЯндексПэйСервис.ПроверитьПараметрыПодключения(ДанныеАутентификации);

	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить проверку данных авторизации платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатПроверки, РезультатОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросыКСервису

// Вызывается при заполнении полей запроса токена.
//
// Параметры:
//  ПараметрыАутентификации - Структура - параметры аутентификации:
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, для который выполняется получение
//        данных аутентификации.
//    * ДанныеАутентификации - Неопределено, Произвольный - данные аутентификации. Неопределено, если данные не найдены.
//  ЗаписьДанныхСообщения - ЗаписьJSON - Данные отправляемого сообщения.
// 
Процедура ПриПодготовкеЗапроса_tokens_request(ПараметрыАутентификации, ЗаписьДанныхСообщения) Экспорт
	
	Если ПараметрыАутентификации.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриПодготовкеЗапроса_tokens_request(
			ПараметрыАутентификации,
			ЗаписьДанныхСообщения);
	
	ИначеЕсли ПараметрыАутентификации.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй Тогда
		
		МодульЯндексПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСобытия");
		МодульЯндексПэйСобытия.ПриПодготовкеЗапроса_tokens_request(
			ПараметрыАутентификации,
			ЗаписьДанныхСообщения);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеОперации

// Создает запрос на возврат оплаты по ранее созданному заказу на оплату.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат оплаты в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//    информационной базе.
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования запроса на возврат оплаты.
//  РезультатОперации - см. ПлатежныеСистемыСлужебный.ВозвратОплаты.
//  ИмяФункции - Строка - имя метода из которого был выполнен вызов для вывода сообщения в случае ошибок.
//
Процедура ПриСозданииВозвратаОплаты(
		ДокументВозврата,
		ДокументОплаты,
		ПараметрыНастройкиПодключения,
		ДополнительныеПараметры,
		РезультатОперации,
		ИмяФункции) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда

		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ДокументОплаты",
			ДокументОплаты,
			Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип);
		
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатВозвратаОплаты = МодульОзонПэйСлужебный.ВозвратОплаты(
			ДокументВозврата,
			ДокументОплаты,
			ПараметрыНастройкиПодключения.Ссылка,
			ДополнительныеПараметры);
	
	ИначеЕсли ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
	
		// Для Яндекс Пэй можно указать строковый идентификатор, чтобы выполнить возврат по документу,
		// созданному в другой базе.
		ОжидаемыеТипыСвойств = Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип.Типы();
		ОжидаемыеТипыСвойств.Добавить(Тип("Строка"));
	
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ДокументОплаты",
			ДокументОплаты,
			ОжидаемыеТипыСвойств);
		
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		РезультатВозвратаОплаты = МодульЯндексПэйСлужебный.ВозвратОплаты(
			ДокументВозврата,
			ДокументОплаты,
			ПараметрыНастройкиПодключения.Ссылка,
			ДополнительныеПараметры);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать запрос на возврат оплаты платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатВозвратаОплаты);
	
КонецПроцедуры

// Определяет механизм получения статуса операции в платежной системе.
//
// Параметры:
//  ПараметрыСтатуса - см. ПлатежныеСистемы.ДанныеОперации.
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//  ЗапросНаличияСтатуса - Булево - если Истина, будет выполнен запрос наличия статуса.
//  РезультатОперации - Структура - результат получения статуса операции.
//
Процедура ПриПолученииСтатусаОперации(
		ПараметрыСтатуса,
		ПараметрыНастройкиПодключения,
		ЗапросНаличияСтатуса,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		РезультатСтатусаОперации = МодульОзонПэйСервис.СтатусОперации(
			ПараметрыСтатуса,
			ПараметрыНастройкиПодключения.Ссылка);
		
	ИначеЕсли ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		Если ПараметрыСтатуса.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииОплата() Тогда
			
			// Для Яндекс Пэй возможно получение статуса только по идентификатору заказа на оплату.
			// Кроме того, на текущий момент, операция возврата является синхронной и не предполагает
			// отложенное получение.
			
			МодульЯндексПэйСервис = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСервис");
			РезультатСтатусаОперации = МодульЯндексПэйСервис.СтатусОперации(
				ПараметрыСтатуса,
				ПараметрыНастройкиПодключения.Ссылка);
		
		Иначе
			
			РезультатСтатусаОперации = ПлатежныеСистемыСлужебный.НовыйРезультатСтатусОперацииСлужебный();
			РезультатСтатусаОперации.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
			РезультатСтатусаОперации.СообщениеОбОшибке = НСтр("ru = 'Получение статуса операции возврата недоступно.'");
			РезультатСтатусаОперации.ИнформацияОбОшибке = РезультатСтатусаОперации.СообщениеОбОшибке;
			
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить статус операции платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатСтатусаОперации);
	
КонецПроцедуры

// Вызывается при активизации кассовой ссылки.
//
// Параметры:
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения.
//  ПараметрыКассовойСсылки - Структура - параметры ссылки, которую нужно активировать:
//    * КлючСсылки - Строка - ключ кассовой ссылки.
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы -документ, который отражает операцию оплаты
//                     в информационной базе.
//  ДополнительныеПараметры - Произвольный -дополнительные настройки формирования заказа на оплату.
//  РезультатОперации - см. ПлатежныеСистемы.АктивироватьКассовуюСсылку.
//
Процедура ПриАктивацииКассовойСсылки(
		ПараметрыНастройкиПодключения,
		ПараметрыКассовойСсылки,
		ДокументОперации,
		ДополнительныеПараметры,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		
		РезультатАктивации = МодульЯндексПэйСлужебный.АктивироватьКассовуюСсылку(
			ПараметрыНастройкиПодключения.Ссылка,
			ПараметрыКассовойСсылки,
			ДокументОперации,
			ДополнительныеПараметры);
		
	Иначе
		
		ИнформацияДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при вызове метода ПлатежныеСистемыСобытия.ПриОтменеДинамическойСсылки.
				|Указанная платежная система недоступна для использования в данном методе,
				|либо соответствующая подсистема не внедрена в конфигурацию.
				|Платежная система: %1
				|Настройка подключения: %2'"),
			ПараметрыНастройкиПодключения.ПлатежнаяСистема,
			ПараметрыНастройкиПодключения.Ссылка);
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияДляЖурнала,
			Истина);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось активировать кассовую ссылку с использованием платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатАктивации);
	
КонецПроцедуры

// Вызывается при деактивации кассовой ссылки.
//
// Параметры:
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения.
//  ПараметрыКассовойСсылки - Структура - параметры ссылки, которую нужно активировать:
//    * КлючСсылки - Строка - ключ кассовой ссылки.
//    * ИдентификаторОперации - Строка - идентификатор заказа на оплату.
//  РезультатОперации - см. ПлатежныеСистемы.ДеактивироватьКассовуюСсылку.
//
Процедура ПриДеактивацииКассовойСсылки(
		ПараметрыНастройкиПодключения,
		ПараметрыКассовойСсылки,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСервис = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСервис");
		
		РезультатДеактивации = МодульЯндексПэйСервис.ДеактивироватьКассовуюСсылку(
			ПараметрыНастройкиПодключения.Ссылка,
			ПараметрыКассовойСсылки);
		
	Иначе
		
		ИнформацияДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при вызове метода ПлатежныеСистемыСобытия.ПриДеактивацииКассовойСсылки:
				|Указанная платежная система недоступна для использования в данном методе,
				|либо соответствующая подсистема не внедрена в конфигурацию.
				|Платежная система: %1
				|Настройка подключения: %2'"),
			ПараметрыНастройкиПодключения.ПлатежнаяСистема,
			ПараметрыНастройкиПодключения.Ссылка);
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияДляЖурнала,
			Истина);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось деактивировать кассовую ссылку с использованием платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатДеактивации);
	
КонецПроцедуры

// Вызывается при получении динамической ссылки.
//
// Параметры:
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы -документ, который отражает операцию оплаты
//                     в информационной базе.
//  ДополнительныеПараметры - Произвольный -дополнительные настройки формирования заказа на оплату.
//  РезультатОперации - см. ПлатежныеСистемы.ДинамическаяСсылка.
//
Процедура ПриПолученииДинамическойСсылки(
		ПараметрыНастройкиПодключения,
		ДокументОперации,
		ДополнительныеПараметры,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		
		РезультатПолучения = МодульЯндексПэйСлужебный.ДинамическаяСсылка(
			ДокументОперации,
			ПараметрыНастройкиПодключения.Ссылка,
			ДополнительныеПараметры);
			
	Иначе
		
		ИнформацияДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при вызове метода ПлатежныеСистемыСобытия.ПриПолученииДинамическойСсылки:
				|Указанная платежная система недоступна для использования в данном методе,
				|либо соответствующая подсистема не внедрена в конфигурацию.
				|Платежная система: %1
				|Настройка подключения: %2'"),
			ПараметрыНастройкиПодключения.ПлатежнаяСистема,
			ПараметрыНастройкиПодключения.Ссылка);
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияДляЖурнала,
			Истина);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить платежную ссылку с использованием платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатПолучения);
	
КонецПроцедуры

// Вызывается при отмене динамической ссылки.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы -документ, который отражает операцию оплаты
//                     в информационной базе.
//  ДанныеОперации - см. ПлатежныеСистемы.ДанныеОперации
//  РезультатОперации - см. ПлатежныеСистемы.ОтменитьДинамическуюСсылку.
//
Процедура ПриОтменеДинамическойСсылки(
		ДокументОперации,
		ДанныеОперации,
		РезультатОперации) Экспорт
	
	Если ДанныеОперации.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ЯндексПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		МодульЯндексПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ЯндексПэйСлужебный");
		
		РезультатОтмены = МодульЯндексПэйСлужебный.ОтменитьДинамическуюСсылку(
			ДокументОперации,
			ДанныеОперации);
			
	Иначе
		
		ИнформацияДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при вызове метода ПлатежныеСистемыСобытия.ПриОтменеДинамическойСсылки.
				|Указанная платежная система недоступна для использования в данном методе,
				|либо соответствующая подсистема не внедрена в конфигурацию.
				|Платежная система: %1
				|Настройка подключения: %2'"),
			ДанныеОперации.ПлатежнаяСистема,
			ДанныеОперации.НастройкаПодключения);
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияДляЖурнала,
			Истина);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось отменить платежную ссылку с использованием платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ДанныеОперации.ПлатежнаяСистема));
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОтмены);
	
КонецПроцедуры

// Определяет для каких операций доступно отложенное получение статуса в разрезе платежных систем.
// 
// Параметры:
//  ДопустимыеОперации - Соответствие Из КлючИЗначение - описание допустимых операций:
//    * Ключ - ПеречислениеСсылка.ПлатежныеСервисы - платежная системы.
//    * Значение - Структура - доступные операции:
//      ** Оплата - Булево - Истина, если доступно выполнение операций оплаты. Ложь, если оплаты и
//           получение статусов по ним возможно только с использованием подсистемы Онлайн-заказы.
//      ** Возврат - Булево - Истина, если есть метод, позволяющий получить статус возврата.
//           Ложь, если возврат является синхронной операцией и платежный сервис не предоставляет
//           механизмов получения статуса.
//
Процедура ПриОпределенииДопустимыхОперацийДляОпределенияСтатуса(ДопустимыеОперации) Экспорт
	
	ДопустимыеОперации.Вставить(
		Перечисления.ПлатежныеСервисы.ОзонПэй,
		Новый Структура(
			"Оплата, Возврат",
			Истина,   // Хотя оплаты в Озон Пэй возможны только через подсистему Онлайн-Заказы,
			Истина)); // а возвраты выполняются синхронно, все же есть возможность получить статусы
					  // обеих этих операций.
					  // Поэтому здесь оба свойства = Истина.
					
	ДопустимыеОперации.Вставить(
		Перечисления.ПлатежныеСервисы.ЯндексПэй,
		Новый Структура(
			"Оплата, Возврат",
			Истина,  // Доступна прямая работа с динамическими и статическими ссылками.
			Ложь));  // Возврат - синхронный метод. Нельзя отложить. Нет метода для получения статуса возврата.
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
